Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Integer in the range -100 through 100 that specifies a change in the amount of red in the image.
fr: Entier compris entre -100 et 100 qui définit la variation de la quantité de rouge dans l'image.

source: Integer in the range -100 through 100 that specifies a change in the amount of green in the image.
fr: Entier compris entre -100 et 100 qui définit la variation de la quantité de vert dans l'image.

source: Integer in the range -100 through 100 that specifies a change in the amount of blue in the image.
fr: Entier compris entre -100 et 100 qui définit la variation de la quantité de bleu dans l'image.

source: CurveAdjustments constant that specifies the adjustment to be applied ($GDIP_Adjust*).
fr: Constante CurveAdjustments qui spécifie l'ajustement à appliquer ($GDIP_Adjust*).

source: CurveChannel constant that specifies the color channel to which the adjustment applies ($GDIP_CurveChannel*).
fr: Constante CurveChannel spécifie le canal de couleur auquel l'ajustement s'applique ($GDIP_CurveChannel*).

source: Integer that specifies the intensity of the adjustment.
fr: Entier qui spécifie l'intensité de l'ajustement.

source: The range of acceptable values depends on which adjustment is being applied (see $GDIP_Adjust* constants).
fr: La plage de valeurs acceptables dépend du réglage qui est appliquée (voir constantes $GDIP_Adjust*).

source: Creates a ColorLUT class effect object
fr: Crée un objet Effect qui agit selon une table donnée de couleurs (LookUpTable)

source: An array[256][4] of a color lookup table for the color channels, alpha, red, green, and blue:
fr: Un tableau [256][4] représentant une table de correspondance des couleurs pour les canaux alpha, rouge, vert et bleu :

source: [0][0] - first adjustment value for the alpha channel
fr: [0][0] - la première valeur de réglage pour le canal alpha

source: [0][1] - first adjustment value for the red channel
fr: [0][1] - la première valeur de réglage pour le canal rouge

source: [0][2] - first adjustment value for the green channel
fr: [0][2] - première valeur de réglage pour le canal vert

source: [0][3] - first adjustment value for the blue channel
fr: [0][3] - première valeur de réglage pour le canal bleu

source: [1][0] - second adjustment value for the alpha channel
fr: [1][0] - deuxième valeur de réglage pour le canal alpha

source: [1][1] - second adjustment value for the red channel
fr: [1][1] - deuxième valeur de réglage pour le canal rouge

source: [1][2] - second adjustment value for the green channel
fr: [1][2] - deuxième valeur de réglage pour le canal vert

source: [1][3] - second adjustment value for the blue channel
fr: [1][3] - deuxième valeur de réglage pour le canal bleu

source: 255][0] - last adjustment value for the alpha channel
fr: [255][0] - dernière valeur de réglage pour le canal alpha

source: [255][1] - last adjustment value for the red channel
fr: [255][1] - dernière valeur de réglage pour le canal rouge

source: [255][2] - last adjustment value for the green channel
fr: [255][2] - la dernière valeur de réglage pour le canal vert

source: [255][3] - last adjustment value for the blue channel
fr: [255] [3] - dernière valeur de réglage pour le canal bleu

source: A lookup table specifies how existing color channel values should be replaced by new values.
fr: La table de correspondance spécifie comment les valeurs existantes des canaux de couleur doivent être remplacées par de nouvelles valeurs.

source: A color channel value of j is replaced by the jth entry in the lookup table for that channel.
fr: La valeur du canal j est remplacée par la j-ième entrée dans la table de correspondance pour ce canal.

source: For example, an existing blue channel value of 25 would be replaced by the value of $aColorLUT[25][3].
fr: Par exemple, une valeur existante du canal bleu de 25 serait remplacé par la valeur de $aColorLUT[25][3].

source: Creates a ColorMatrixEffect class effect object
fr: Crée un objet Effect qui agit selon une matrice couleur donnée

source: ColorMatrix structure.
fr: La structure ColorMatrix.

source: Creates a HueSaturationLightness class effect object
fr: Crée un objet Effect qui agit sur teinte/saturation/luminosité

source: Integer in the range -180 through 180 that specifies the change in hue.
fr: Entier compris entre -180 et 180 qui spécifie la variation de teinte.

source: Integer in the range -180 through 180 that specifies the change in saturation.
fr: Entier compris entre -180 à 180 qui spécifie la variation de la saturation.

source: Integer in the range -180 through 180 that specifies the change in lightness.
fr: Entier compris entre -180 et 180 qui spécifie la variation de luminosité.

source: Creates a Levels class effect object
fr: Crée un objet Effect qui agit sur la brillance

source: Integer in the range 0 through 100 that specifies which pixels should be lightened.
fr: Entier compris entre 0 et 100 qui spécifie les pixels qui doivent être mis en surbrillance.

source: Integer in the range -100 through 100 that specifies how much to lighten or darken an image.
fr: Entier compris entre -100 et 100 qui spécifie de combien il faut éclaircir ou assombrir une image.

source: Integer in the range 0 through 100 that specifies which pixels should be darkened.
fr: Entier compris entre 0 et 100 qui spécifie les pixels qui doivent être obscurcis.

source: Creates a RedEyeCorrection class effect object
fr: Crée un objet Effect qui corrige les yeux rouges

source: An array of areas of the bitmap to which red eye correction should be applied:
fr: Un tableau de régions du bitmap dans lesquelles la correction des yeux rouges doit être appliquée:

source: [0][0] - Number of Area rectangles
fr: [0][0] - Nombre de régions toutes rectangulaires

source: [1][0] - X coordinate of the upper-left corner of the first rectangle
fr: [1][0] - Coordonnée X du coin supérieur gauche du premier rectangle

source: [1][1] - Y coordinate of the upper-left corner of the first rectangle
fr: [1][1] - Coordonnée Y du coin supérieur gauche du premier rectangle

source: [1][2] - Width of the first rectangle
fr: [1][2] - Largeur du premier rectangle

source: [1][3] - Height of the first rectangle
fr: [1][3] - Hauteur du premier rectangle

source: [n][0] - X coordinate of the upper-left corner of the nth rectangle
fr: [n][0] - Coordonnée X du coin supérieur gauche du n-ième rectangle

source: [n][1] - Y coordinate of the upper-left corner of the nth rectangle
fr: [n][1] - Coordonnée Y du coin supérieur gauche du n-ième rectangle

source: [n][2] - Width of the nth rectangle
fr: [n][2] - Largeur du n-ième rectangle

source: [n][3] - Height of the nth rectangle
fr: [n][3] - Hauteur du n-ième rectangle

source: Code below was generated by:
fr: Le code ci-dessous a été généré par :

source: 'File to Base64 String' Code Generator v1.11 Build 2012-10-13
fr: 'File Base64 String' Code Generator v1.11 Build 13/10/2012

source: Creates a Sharpen class effect object
fr: Crée un objet Effet qui agit sur la netteté

source: Real number that specifies the sharpening radius (the radius of the convolution kernel) in pixels.
fr: Nombre réel qui indique le rayon de netteté (le rayon du noyau de convolution) en pixels.

source: The radius must be in the range 0.0 through 255.0
fr: Le rayon doit être compris entre 0,0 et 255,0

source: Real number in the range 0.0 through 100.0 that specifies the amount of sharpening to be applied
fr: Nombre réel compris entre 0,0 et 100,0 qui indique le degré de netteté à appliquer

source: Creates a Tint class effect object
fr: Crée un objet Effect qui agit sur la teinte

source: Integer in the range -180 through 180 that specifies the hue to be strengthened or weakened.
fr: Entier compris entre -180 et 180 qui indique la teinte qui doit être renforcée ou affaiblie.

source: Integer in the range -100 through 100 that specifies how much the hue (given by the hue parameter) is strengthened or weakened.
fr: Entier compris entre -100 et 100 qui indique de combien la teinte (donnée par le paramètre $iHue) est renforcée ou affaiblie.

source: Deletes the specified Effect object
fr: Supprime l'objet Effet spécifié

source: Handle to an Effect object.
fr: Handle de l'objet Effect.

source: Search GdipDeleteEffect in MSDN Library
fr: Consultez GdipDeleteEffect dans la Librairie MSDN.

source: Returns the parameters for the specified Effect object
fr: Retourne les paramètres de l'objet Effet spécifié

source: A DLL structure that receives the effect parameters.
fr: Structure DLL qui reçoit les paramètres de l'effet.

source: Search GdipGetEffectParameters in MSDN Library
fr: Consultez GdipGetEffectParameters dans la Librairie MSDN.

source: Sets the parameters for the specified Effect object
fr: Définit les paramètres de l'objet Effet spécifié

source: A DLL structure that specifies the parameters.
fr: Structure DLL qui spécifie les paramètres.

source: An integer value.Default is 1.
fr: Une valeur entière (1 par défaut).

source: Search GdipSetEffectParameters in MSDN Library
fr: Consultez GdipSetEffectParameters dans la Librairie MSDN.

source: Get an array of information about the available image encoders
fr: Obtient un tableau d'informations sur les encodeurs d'images disponibles

source: Search GdipGetImageEncoders in MSDN Library
fr: Consultez GdipGetImageEncoders dans la Librairie MSDN.

source: Return the encoder CLSID for a specific image file type
fr: Retourne le CLSID de l'encodeur pour un type de fichier image spécifique

source: File extension to search for (BMP, JPG, TIF, etc.)
fr: L'extension de fichier à rechercher (BMP, JPG, TIF, etc.)

source: the CLSID of the encoder in string format.
fr: Retourne le CLSID de l'encodeur sous la forme d'une chaîne.

source: an empty string and sets the @error flag to non-zero, @extended may contain GPSTATUS error code ($GPID_ERR*).
fr: Retourne une chaîne vide et @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*).

source: Get the number of available image encoders
fr: Obtient le nombre d'encodeurs d'images disponibles

source: the number of image encoders.
fr: Retourne le nombre d'encodeurs d'image.

source: Search GdipGetImageEncodersSize in MSDN Library
fr: Consultez GdipGetImageEncodersSize dans la Librairie MSDN.

source: Get the parameter list for a specified image encoder
fr: Obtient la liste des paramètres pour un encodeur d'image spécifié

source: Handle to an image object
fr: Handle de l'objet Image

source: GUID string of encoder to be used
fr: Chaîne GUID de l'encodeur à utiliser

source: a $tagGDIPENCODERPARAMS structure.
fr: Retourne une structure $tagGDIPENCODERPARAMS.

source: Search GdipGetEncoderParameterList in MSDN Library
fr: Consultez GdipGetEncoderParameterList dans la Librairie MSDN.

source: Get the size of the parameter list for a specified image encoder
fr: Obtient la taille de la liste de paramètres pour un encodeur d'image spécifié

source: the size, in bytes, of the parameter list.
fr: Retourne la taille, en octets, de la liste des paramètres.

source: Search GdipGetEncoderParameterListSize in MSDN Library
fr: Consultez GdipGetEncoderParameterListSize dans la Librairie MSDN.

source: Get the total size of the structure that is returned by _GDIPlus_GetImageEncoders
fr: Obtient la taille totale de la structure qui est retournée par _GDIPlus_GetImageEncoders

source: Create a Font object
fr: Crée un objet Font (police)

source: Handle to a Font Family object
fr: Handle d'un objet Font Family (famille de polices)

source: The size of the font measured in the units specified in the $iUnit parameter
fr: La taille de la police mesurée dans l'unité spécifiée dans le paramètre $iUnit

source: The style of the typeface.
fr: Le style de la police.

source: 0 - Normal weight or thickness of the typeface
fr: 0 - Graisse ou épaisseur normale

source: 1 - Bold typeface
fr: 1 - Gras

source: 2 - Italic typeface
fr: 2 - Italique

source: 4 - Underline
fr: 4 - Souligné

source: 8 - Strikethrough
fr: 8 - Barré

source: Unit of measurement for the font size:
fr: Unité de mesure de la taille de la police:

source: 0 - World coordinates, a nonphysical unit
fr: 0 - Coordonnées universelles, une unité non physique

source: 1 - Display units
fr: 1 - Unité d'affichage

source: 2 - A unit is 1 pixel
fr: 2 - Unité de 1 pixel

source: 3 - A unit is 1 point or 1/72 inch
fr: 3 - Unité de 1 point ou 1/72 de pouce

source: 4 - A unit is 1 inch
fr: 4 - Unité de 1 pouce

source: 5 - A unit is 1/300 inch
fr: 5 - Unité de 1/300 pouces

source: 6 - A unit is 1 millimeter
fr: 6 - Unité de 1 millimètre

source: a handle to a Font object.
fr: Retourne le handle d'un objet Font.

source: When you are done with the Font object, call _GDIPlus_FontDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet Font, appelez _GDIPlus_FontDispose() pour libérer les ressources.

source: Search GdipCreateFont in MSDN Library
fr: Consultez GdipCreateFont dans la Library MSDN.

source: Draw a string
fr: Dessine une chaîne

source: Release a Font object
fr: Libère un objet Font

source: Handle to a Font object
fr: Handle de l'objet Font

source: Search GdipDeleteFont in MSDN Library
fr: Consultez GdipDeleteFont dans la Library MSDN.

source: Create a Font Family object
fr: Crée un objet Font Family

source: Name of the Font Family
fr: Nom de la famille de polices

source: Pointer to a FontCollection object that specifies the collection that the font family belongs to.
fr: Handle de l'objet FontCollection qui spécifie la collection à laquelle la famille de polices appartient.

source: a handle to a Font Family object.
fr: Retourne le handle d'un objet Font Family.

source: When you are done with the Font Family object, call _GDIPlus_FontFamilyDispose() to release the resources.
fr: Lorsque vous en avez terminé avec la famille de polices, appelez _GDIPlus_FontFamilyDispose() pour libérer les ressources.

source: Search GdipCreateFontFamilyFromName in MSDN Library
fr: Consultez GdipCreateFontFamilyFromName dans la Library MSDN.

source: Release a Font Family object
fr: Libère un objet Font Family

source: Search GdipDeleteFontFamily in MSDN Library
fr: Consultez GdipDeleteFontFamily dans la Library MSDN.

source: Gets the size (commonly called em size or em height), in design units, of a font family
fr: Obtient la taille (communément appelée taille em ou hauteur em ), en unités de design, d'une famille de polices

source: Pointer to a FontFamily object
fr: Handle de l'objet FontFamily

source: the size, in design units, of this font family.
fr: Retourne la taille, dans l'unité de design, de cette famille de polices.

source: Search GdipGetEmHeight in MSDN Library
fr: Consultez GdipGetEmHeight dans la Library MSDN.

source: Gets the line spacing, in design units, of this font family for the specified style or style combination
fr: Obtient l'espacement entre les lignes, en unités de design, d'une famille de polices pour un style ou une combinaison de style spécifié

source: the line spacing, in design units, of this font family.
fr: Retourne l'interligne, en unités de design, de cette famille de polices.

source: Search GdipGetLineSpacing in MSDN Library
fr: Consultez GdipGetLineSpacing dans la Library MSDN.

source: Gets the line spacing of a font in the current unit of a specified Graphics object
fr: Obtient l'espacement des lignes d'une police dans l'unité courante d'un objet graphique spécifié

source: Pointer to a Font object
fr: Handle de l'objet Font

source: Pointer to a Graphics object
fr: Handle de l'objet Graphics

source: the line spacing of this font.
fr: Retourne l'interligne de cette police.

source: The line spacing is the vertical distance between the base lines of two consecutive lines of text.
fr: L'espacement entre les lignes est la distance verticale entre les lignes de base de deux lignes consécutives de texte.

source: Thus, the line spacing includes the blank space between lines along with the height of the character itself.
fr: Ainsi, l'espacement de ligne comprend l'espace blanc entre les lignes avec en plus la hauteur du caractère lui-même.

source: Search GdipGetFontHeight in MSDN Library
fr: Consultez GdipGetFontHeight dans la Library MSDN.

source: Clears a Graphics object to a specified color
fr: Efface un objet Graphics avec une couleur spécifiée

source: Alpha, Red, Green and Blue components of color
fr: Composantes de la couleur:Alpha, Rouge, Vert et Bleu

source: Search GdipGraphicsClear in MSDN Library
fr: Consultez GdipGraphicsClear dans la Librairie MSDN.

source: Clear the screen capture
fr: Efface la capture d'écran

source: Create a Graphics object from a device context (DC)
fr: Crée un objet Graphics à partir d'un contexte de périphérique (Device Context)

source: Device context
fr: Contexte de périphérique

source: a handle to a Graphics object.
fr: Retourne le handle de l'objet Graphics.

source: When you are done with the Graphics object, call _GDIPlus_GraphicsDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet Graphics, appelez _GDIPlus_GraphicsDispose() pour libérer les ressources.

source: Search GdipCreateFromHDC in MSDN Library
fr: Consultez GdipCreateFromHDC dans la Librairie MSDN.

source: Create a Graphics object from a window handle
fr: Crée un objet Graphics à partir d'un handle de fenêtre

source: Handle to a window
fr: Handle de la fenêtre

source: Search GdipCreateFromHWND in MSDN Library
fr: Consultez GdipCreateFromHWND dans la Librairie MSDN.

source: Release a Graphics object
fr: Libère un objet Graphics

source: Search GdipDeleteGraphics in MSDN Library
fr: Consultez GdipDeleteGraphics dans la Librairie MSDN.

source: Draw an arc
fr: Dessine un arc d'ellipse ou de cercle

source: The X coordinate of the upper left corner of the rectangle that bounds the ellipse in which to draw the arc
fr: La coordonnée X du coin supérieur gauche du rectangle qui délimite l'ellipse qui contient l'arc à dessiner

source: The Y coordinate of the upper left corner of the rectangle that bounds the ellipse in which to draw the arc
fr: La coordonnée Y du coin supérieur gauche du rectangle qui délimite l'ellipse qui contient l'arc à dessiner

source: The width of the rectangle that bounds the ellipse in which to draw the arc
fr: La largeur du rectangle qui délimite l'ellipse qui contient l'arc à dessiner

source: The height of the rectangle that bounds the ellipse in which to draw the arc
fr: La hauteur du rectangle qui délimite l'ellipse qui contient l'arc à dessiner

source: The angle between the X axis and the starting point of the arc
fr: L'angle entre l'axe des X et le point de départ de l'arc

source: The angle between the starting and ending points of the arc
fr: L'angle entre les points de début et de fin de l'arc

source: Handle to a pen object that is used to draw the arc.
fr: Handle d'un objet Pen qui sera utilisé pour dessiner l'arc.

source: If 0, a solid black pen with a width of 1 will be used.
fr: Si 0, un crayon noir qui trace des lignes continues de largeur de 1 sera utilisé.

source: Search GdipDrawArc in MSDN Library
fr: Consultez GdipDrawArc dans la Librairie MSDN.

source: Draw arcs
fr: Dessine des arcs

source: color format AARRGGBB (hex)
fr: Format de couleur AARRGGBB (hex)

source: Draw a bezier spline
fr: Dessine une courbe de Bézier

source: X coordinate of the starting point
fr: Coordonnée X du point de départ

source: Y coordinate of the starting point
fr: Coordonnée Y du point de départ

source: X coordinate of the first control point
fr: Coordonnée X du premier point de contrôle

source: Y coordinate of the first control point
fr: Coordonnée Y du premier point de contrôle

source: X coordinate of the second control point
fr: Coordonnée X du second point de contrôle

source: Y coordinate of the second control point
fr: Coordonnée Y du second point de contrôle

source: X coordinate of the ending point
fr: Coordonnée X du point final

source: Y coordinate of the ending point
fr: Coordonnée Y du point final

source: Handle to a pen object that is used to draw the bezier.
fr: Handle d'un objet Pen qui sera utilisé pour dessiner la courbe de Bézier.

source: A Bezier spline does not pass through its control points.
fr: Une courbe de Bézier ne passe pas par les points de contrôle.

source: The control points act as magnets, pulling the curve in certain directions to influence the way the spline bends.
fr: Les points de contrôle agissent comme des aimants, tirant la courbe dans certaines directions pour définir sa forme.

source: Search GdipDrawBezier in MSDN Library
fr: Consultez GdipDrawBezier dans la Librairie MSDN.

source: Draw a Bezier curve
fr: Dessine une courbe de Bézier

source: Draw a closed cardinal spline
fr: Dessine une spline cardinale fermée

source: Array that specifies the points of the curve:
fr: Tableau qui contient des points de la courbe :

source: [0][0] - Number of points
fr: [0][0] - Nombre de points

source: [1][0] - Point 1 X position
fr: [1][0] - Point 1 - abscisse X

source: [1][1] - Point 1 Y position
fr: [1][1] - Point 1 - ordonnée Y

source: [2][0] - Point 2 X position
fr: [2][0] - Point 2 - abscisse X

source: [2][1] - Point 2 Y position
fr: [2][1] - Point 2 - ordonnée Y

source: [n][0] - Point n X position
fr: [n][0] - Point n - abscisse X

source: [n][1] - Point n Y position
fr: [n][1] - Point n - ordonnée Y

source: Handle to a pen object that is used to draw the spline.
fr: Handle de l'objet Pen qui sera utilisé pour dessiner la courbe.

source: In a closed cardinal spline, the curve continues through the last point in the points array and connects with the first point in the array.
fr: Dans une spline cardinale fermée, la courbe se poursuit après le dernier point du tableau et se connecte avec le premier point du tableau.

source: The array of points must contain a minimum of three elements.
fr: La tableau de points doit contenir un minimum de trois éléments.

source: Search GdipDrawClosedCurve in MSDN Library
fr: Consultez GdipDrawClosedCurve dans la Librairie MSDN.

source: Draw a cardinal spline
fr: Dessine une spline cardinale

source: Draws a closed cardinal spline
fr: Dessine une spline cardinale fermée

source: Array of points that specify the coordinates of the closed cardinal spline.
fr: Tableau de points qui spécifie les coordonnées de la spline cardinale fermée.

source: The array must
fr: Le tableau doit être de la forme suivante:

source: Number that specifies how tightly the curve bends through the coordinates of the closed cardinal spline
fr: Nombre qui spécifie comment la courbe sera tendue sur les points/td>

source: Handle to a pen object that is used to draw the splines.
fr: Handle de l'objet Pen qui est utilisé pour dessiner les splines.

source: If 0, a solid black pen with a width of
fr: Si 0, un crayon noir qui trace des lignes continues de largeur 1

source: Search GdipDrawClosedCurve2 in MSDN Library
fr: Consultez GdipDrawClosedCurve2 dans la Librairie MSDN.

source: x coordinate of the point
fr: Coordonnée x du point

source: y coordinate of the point
fr: Coordonnée y du point

source: x vector of the point
fr: x vecteur du point

source: y vector of the point
fr: y vecteur du point

source: clear bitmap for repaint
fr: Efface bitmap pour repeindre

source: draw closed curve
fr: Dessine la courbe fermée

source: copy bitmap to graphic handle (GUI)
fr: Copie le bitmap sur le handle graphique (GUI)

source: calculate new x position
fr: Calcule la nouvelle position x

source: if vertical border is reached invert x vector
fr: si bordure verticale est atteinte inverser vecteur x

source: calculate new y position
fr: Calcule la nouvelle position y

source: if horizontal border is reached invert y vector
fr: si la bordure horizontale est atteinte inverser y vecteur
